test_data/did_auth_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ecard="http://www.bsi.bund.de/ecard/api/1.1">
  <soapenv:Header/>
  <soapenv:Body>
    <ecard:DIDAuthenticate>
      <ecard:ConnectionHandle>
        <ecard:ChannelHandle>1749555187773228668-PvaSgaJVhSTotu2g</ecard:ChannelHandle>
        <ecard:IFDName>Terminal</ecard:IFDName>
        <ecard:SlotIndex>0</ecard:SlotIndex>
      </ecard:ConnectionHandle>
      <ecard:DIDName>EAC</ecard:DIDName>
      <ecard:AuthenticationProtocolData Protocol="urn:iso:std:iso-iec:24727:part:3:profile:EAC1InputType">
        <ecard:Certificate>fyGCAUh/ToIBAF8pAQBCDkRFRVNURFYxQTAwMDAxf0lPBgoEAH8ABwICAgIDhkEENInsdSNhz9eI
zxhnEA3/zZ5mAczwUKFe8BDbebzM3dByuxOmaqxSwJFIhaUGP4cww00iIO1HfXQWRSbX3P6EUF8g
EERFRVNUVEVSTTFBMDAwMDF/TBIGCQQAfwAHAwECAlMFPA/z//9fJQYBBgEAAARfJAYCBwAJAQdl
XnMtBgkEAH8ABwMBAwGAIIhWdbKrl2UA5Lg20dJQAR0QcMAlvI/SBBV5YPlbC1Vpcy0GCQQAfwAH
AwEDAoAgFElpI4tq5AbJDyLxCSu4PMg0AgEo1wtw/KbKQ73B1Q9fN0AKtwZ+GokkQX4v1WngAGGD
eP7Es0O1H+kIzhzdBYhWXxiR94F+RuRMu9zH3UzNvwjj2Vq2sB29VOWGecLRY8uqfyGB5n9OgZ9f
KQEAQg9ERUVTVENWQ0ExMDAwMDF/SU8GCgQAfwAHAgICAgOGQQRn7S755ysRLhxoAWLK3LObsXFJ
ae0FV15jsYR6htkLvUho8Zc4VlLWdTxPaPoclqMzWAiZkI8nupZQ7TevBKDcXyAOREVFU1REVjFB
MDAwMDF/TBIGCQQAfwAHAwECAlMFvh////9fJQYBBgEAAARfJAYDAAAGAQNfN0A9TXs+Afp22las
XkKMSyk0ATD8ZZlAeV+s/QmFL/+M42bG66VWl0Zyor1US149bStjvyd15e/ID1GvUtU3SW6SfyGC
Abh/ToIBcF8pAQBCD0RFRVNUQ1ZDQTEwMDAwMX9JggEdBgoEAH8ABwICAgIDgSCp+1fboe6pvD5m
CpCdg41ybjv2I9UmICggE0gdH25Td4IgfVoJdfwsMFfu9nUwQXr/5/uAVcEm3Fxs6UpLRPMwtdmD
ICbcXGzpSktE8zC12bvXfL+VhBYpXPfhzmvM3Bj/jAe2hEEEi9Kuuct+V8ssS0gv/IG3r7neJ+Hj
vSPCOkRTvZrOMmJUfvg1w9rE/Zf4RhoUYR3JwndFEy3tjlRcHVTHLwRpl4UgqftX26Huqbw+ZgqQ
nYONcYw5eqO1Yab3kB4OgpdIVqeGQQR4MZvJQ9f6sHryphz8Ghv3EksyP4W087LT9eeVW2kTZXtv
qnzuSvslhPGgayr3d1N7BcGKSI08F+pzUXpeBSOqhwEBXyAPREVFU1RDVkNBMTAwMDAxf0wSBgkE
AH8ABwMBAgJTBf4f////XyUGAQYABAABXyQGAwIACQAEXzdAR/9u7Kk+FeiDIrjaCmjBhhxQoUmO
x1Phg3kzf3xjWLZ2EhveqcEuhDAyE1ssdDEYjgYbbwSu42Lr3Wbo6eoPsQ==
</ecard:Certificate>
        <ecard:CertificateDescription>
          <SubjectURL>https://eservice.example.com</SubjectURL>
          <CommCertificates>SHA256_HASH_OF_TLS_CERT</CommCertificates>
        </ecard:CertificateDescription>
        <ecard:RequiredCHAT>7f4c12060904007f00070301020253053c0ff3ffff</ecard:RequiredCHAT>
        <ecard:OptionalCHAT>7f4c12060904007f00070301020253053c0ff3ffff</ecard:OptionalCHAT>
        <ecard:AuthenticatedAuxiliaryData>TRANSACTION_INFO</ecard:AuthenticatedAuxiliaryData>
      </ecard:AuthenticationProtocolData>
    </ecard:DIDAuthenticate>
  </soapenv:Body>
</soapenv:Envelope>
